Revit 2027 API
CombinableElementArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual CombinableElementArrayIterator ForwardIterator()
Public Overridable Function ForwardIterator As CombinableElementArrayIterator
public:
virtual CombinableElementArrayIterator^ ForwardIterator()
abstract ForwardIterator : unit -> CombinableElementArrayIterator
override ForwardIterator : unit -> CombinableElementArrayIterator
Return Value
CombinableElementArrayIterator
Returns a forward moving iterator to the array.
See Also
Reference
CombinableElementArray Class
Autodesk.Revit.DB Namespace